.. _cpr_userguide:

CPR Strings
============

Introduction
------------

The function :func:`clean_dk_cpr() <dataprep.clean.clean_dk_cpr.clean_dk_cpr>` cleans a column containing Danish citizen number (CPR) strings, and standardizes them in a given format. The function :func:`validate_dk_cpr() <dataprep.clean.clean_dk_cpr.validate_dk_cpr>` validates either a single CPR strings, a column of CPR strings or a DataFrame of CPR strings, returning `True` if the value is valid, and `False` otherwise.

CPR strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "211062-5629"
* `standard`: CPR strings with proper whitespace in the proper places, like "2110625629"
* `birthdate`: split the number and return the birth date, like "1862-10-21".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_dk_cpr()` and `validate_dk_cpr()`.

### An example dataset containing CPR strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "cpr": [
            "2110625629",
            "511062-5629",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

           cpr                                           address
0   2110625629                                     123 Pine Ave.
1  511062-5629                                           main st
2  999 999 999                      1234 west main heights 57033
3    004085616                    apt 1 789 s maple rd manhattan
4  002 724 334                robie house, 789 north main street
5        hello         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NULL                                             hello

## 1. Default `clean_dk_cpr`

By default, `clean_dk_cpr` will clean cpr strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_dk_cpr
clean_dk_cpr(df, column = "cpr")

           cpr                                           address    cpr_clean
0   2110625629                                     123 Pine Ave.  211062-5629
1  511062-5629                                           main st          NaN
2  999 999 999                      1234 west main heights 57033          NaN
3    004085616                    apt 1 789 s maple rd manhattan          NaN
4  002 724 334                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_dk_cpr(df, column = "cpr", output_format="standard")

           cpr                                           address    cpr_clean
0   2110625629                                     123 Pine Ave.  211062-5629
1  511062-5629                                           main st          NaN
2  999 999 999                      1234 west main heights 57033          NaN
3    004085616                    apt 1 789 s maple rd manhattan          NaN
4  002 724 334                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `compact`

In [4]:
clean_dk_cpr(df, column = "cpr", output_format="compact")

           cpr                                           address   cpr_clean
0   2110625629                                     123 Pine Ave.  2110625629
1  511062-5629                                           main st         NaN
2  999 999 999                      1234 west main heights 57033         NaN
3    004085616                    apt 1 789 s maple rd manhattan         NaN
4  002 724 334                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

### `birthdate`

In [5]:
clean_dk_cpr(df, column = "cpr", output_format="birthdate")

           cpr                                           address   cpr_clean
0   2110625629                                     123 Pine Ave.  1862-10-21
1  511062-5629                                           main st         NaN
2  999 999 999                      1234 west main heights 57033         NaN
3    004085616                    apt 1 789 s maple rd manhattan         NaN
4  002 724 334                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned CPR strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_dk_cpr(df, column="cpr", inplace=True)

     cpr_clean                                           address
0  211062-5629                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_dk_cpr(df, "cpr", errors="coerce")

           cpr                                           address    cpr_clean
0   2110625629                                     123 Pine Ave.  211062-5629
1  511062-5629                                           main st          NaN
2  999 999 999                      1234 west main heights 57033          NaN
3    004085616                    apt 1 789 s maple rd manhattan          NaN
4  002 724 334                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `ignore`

In [8]:
clean_dk_cpr(df, "cpr", errors="ignore")

           cpr                                           address    cpr_clean
0   2110625629                                     123 Pine Ave.  211062-5629
1  511062-5629                                           main st  511062-5629
2  999 999 999                      1234 west main heights 57033  999 999 999
3    004085616                    apt 1 789 s maple rd manhattan    004085616
4  002 724 334                robie house, 789 north main street  002 724 334
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        hello
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 4. `validate_dk_cpr()`

`validate_dk_cpr()` returns `True` when the input is a valid CPR. Otherwise it returns `False`.

The input of `validate_dk_cpr()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_dk_cpr()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_dk_cpr()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_dk_cpr
print(validate_dk_cpr("2110625629"))
print(validate_dk_cpr("511062-5629"))
print(validate_dk_cpr("999 999 999"))
print(validate_dk_cpr("51824753556"))
print(validate_dk_cpr("004085616"))
print(validate_dk_cpr("hello"))
print(validate_dk_cpr(np.nan))
print(validate_dk_cpr("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_dk_cpr(df["cpr"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: cpr, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_dk_cpr(df, column="cpr")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: cpr, dtype: bool

### Only DataFrame

In [12]:
validate_dk_cpr(df)

     cpr  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False